Bukluran8.0/app/controllers/accounts_controller.rb

SELECT * FROM "accounts"
---
  def index
    @accounts = Account.all

SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
---
  def show
    @account = Account.find(params[:id])

INSERT INTO "accounts" ("updated_at", "username", "password", "group", "created_at") VALUES('2009-07-14 13:38:30', 'osa', '12345', 'OSA', '2009-07-14 13:38:30')
INSERT INTO "osas" ("updated_at", "account_id", "isopen", "coordinator", "created_at") VALUES('2009-07-14 13:38:30', NULL, 'f', 'osa', '2009-07-14 13:38:30')
UPDATE "osas" SET "account_id" = 1, "updated_at" = '2009-07-14 13:38:30' WHERE "id" = 1
---
  def create
    @account = Account.new(params[:account])
    if @account.save
      flash[:notice] = "Successfully Created New Account"
      @owner = nil
      case @account.group
        when 'OSA'
          @owner = Osa.create(:coordinator => 'osa')
        when 'ORGANIZATION'
          @owner = Organization.create(:name => 'new organization', :status => 'Not Renewed')
      end
      @owner.account = @account
      @owner.save